In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("./Social_Network_Ads.csv")

In [3]:
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
dataset.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [5]:
dataset.drop("User ID",axis=1,inplace=True)

In [6]:
dataset.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [7]:
Y = dataset.iloc[:,3]
Y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [8]:
X = dataset.iloc[:,0:3]
X.head()

   Gender  Age  EstimatedSalary
0    Male   19            19000
1    Male   35            20000
2  Female   26            43000
3  Female   27            57000
4    Male   19            76000

In [9]:
sex = pd.get_dummies(X["Gender"],drop_first=True)
sex.head()

   Male
0     1
1     1
2     0
3     0
4     1

In [10]:
X = pd.concat([X,sex],axis=1)
X.head()

   Gender  Age  EstimatedSalary  Male
0    Male   19            19000     1
1    Male   35            20000     1
2  Female   26            43000     0
3  Female   27            57000     0
4    Male   19            76000     1

In [11]:
X.drop("Gender",axis=1,inplace=True)
X.head()

   Age  EstimatedSalary  Male
0   19            19000     1
1   35            20000     1
2   26            43000     0
3   27            57000     0
4   19            76000     1

In [12]:
from sklearn.cross_validation import train_test_split
X_train, X_test, y_train,y_test = train_test_split(X,Y,test_size=1/3,random_state = 42)

/home/rishi/anaconda3/lib/python3.6/site-packages/sklearn/cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [13]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier(criterion='entropy',random_state=42)
classifier.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=42,
            splitter='best')

In [14]:
predictions = classifier.predict(X_test)

In [15]:
from sklearn.metrics import classification_report
classification_report(predictions, y_test)

'             precision    recall  f1-score   support\n\n          0       0.89      0.90      0.89        80\n          1       0.85      0.83      0.84        54\n\navg / total       0.87      0.87      0.87       134\n'

In [16]:
from sklearn.metrics import confusion_matrix
confusion_matrix(predictions, y_test)

array([[72,  8],
       [ 9, 45]])

In [17]:
from sklearn.metrics import accuracy_score 
accuracy_score(predictions, y_test) * 100

87.31343283582089

In [18]:
from sklearn.metrics import roc_auc_score
roc_auc_score(y_test, predictions)

0.8689727463312369